{
    "data": [
        {
            "title" : "type 1",
            "type": "A **mortgage is a type **of loan that helps you buy a property. When you get a mortgage, a lender gives you a large sum of money to help pay for a home. In return, you agree to pay back this money over time, plus interest. You also agree that if you can’t pay the money back, the lender can take possession of your property to get their money back."
        },
        {
            "title" : "type 2",
            "type": "To get a mortgage, you basically need to: 1. **Check your credit score** - It tells lenders if lending to you is risky or not. 2. **Know your budget** - Figure out what you can pay back each month without struggling. 3. **Save for a deposit** - A bigger deposit can get you a better deal. 4. **Get an agreement in principle** - It shows you’re not just window shopping. 5. **Find your home** - Once you’ve got a place in mind, you can apply for real. 6. **Apply for a mortgage** - Show them you’re good for the money with your payslips and bank info. 7. **Finish your application** - If all goes well, start packing boxes."
        },
        {
            "title" : "type 3",
            "type": "In the UK, you have several types of mortgages to choose from: - **Repayment Mortgages**: Each month, you pay back part of the borrowed amount plus interest. This means by the end of the term, you’ve paid everything off. - **Interest-only Mortgages**: You only pay the interest each month. The original loan amount is paid at the end of the mortgage term in one lump sum. - **Fixed-rate Mortgages**: The interest rate stays the same for a set period, so your payments are predictable. - **Variable-rate Mortgages**: The interest rate can change, affecting your payment amounts. These are the main types, but there are other specific options tailored to different buyers, such as buy-to-let mortgages for landlords."
        },
        {
            "title" : "type 4",
            "type": "**Credit card interest** is the extra amount you pay when you borrow money using a credit card. If you don’t pay your full balance by the due date, the bank or company that gave you the credit card will charge you interest. This means you pay back more than you originally spent."
        },
        {
            "title" : "type 5",
            "type": "Your credit score is important when you want to get a mortgage. It helps lenders decide if they should lend you money and what interest rate they should charge. Here’s what you should know: - **Higher credit scores** often lead to better mortgage rates because you appear less risky to lenders. - **Lower credit scores** might still get you a mortgage, but you could pay more in interest over time. Lenders look at your credit history, how well you’ve managed past debts, and your current debts to make their decision."
        }
    ]
}